#include<stdio.h>
int main(void)
{
	int c[10]={1,2,3,4,5,6,7,8,9,10};
	int *k=c;//为下面二维数组铺垫
	printf("%d\n",*(k+3));//(4) 
	
	int b[3][4]={1,2,3,4,5,6,7,8,9,10,11,12};
	int (*q)[4]=b;//这里的*q代表二维数组第一维，[4]代表第二维，同b的行列数一致（三行四列），与b兼容，没有警告 
	printf("%d\n",*(*(q+2)+1));//打印二维数组第三行第二列（10） 
	int (*t)[3]=b;//由于要赋值b，所以二维数组是四行三列，与b不兼容（赋值成功是因为二维数组实际是划分好的一维数组，按照顺序赋值），会警告 
	printf("%d\n",*(*(t+2)+1));//打印二维数组第三行第二列（8） 
	
	int a[24]={1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24};
	int (*p)[2][4]=a;//三维数组，同上 
	printf("%d\n",*(*(*(p+2)+0)+2));//打印（3，1，3）（19） 
	return 0;
}
